AV/FO/INTERSPEC_interfaces_SAP/ExpSapHU/Exp2Sap-example-UpdateCreateBOM-xml.txt

<soap:Envelope xmlns:xsl="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <UpdateOrCreateBom xmlns="http://apollovredestein.com/interspec_sap">
      <SequenceNr>243019</SequenceNr>
      <Plant>5M01</Plant>
      <Article>E1LV568</Article>
      <UoM>M</UoM>
      <ValidFrom>2023-06-21</ValidFrom>
      <BomVersions>
        <BomVersion>
          <VersionNr>1</VersionNr>
          <OutputAmount>1</OutputAmount>
          <BomUsage>1</BomUsage>
          <BomStatus>4</BomStatus>
          <BomItems>
            <BomItem>
              <LineNr>20</LineNr>
              <ItemCategory>L</ItemCategory>
              <ArticleCode>E1704</ArticleCode>
              <Amount>1.511</Amount>
              <UoM>KG</UoM>
              <Scrap>0</Scrap>
              <Costing>X</Costing>
              <FunctionCode>Tread compound</FunctionCode>
              <ValidFrom/>
              <ValidUntil/>
              <MaxShelfLife>-1</MaxShelfLife>
              <MinAging>-1</MinAging>
            </BomItem>
            <BomItem>
              <LineNr>30</LineNr>
              <ItemCategory>L</ItemCategory>
              <ArticleCode>E1722</ArticleCode>
              <Amount>0.134</Amount>
              <UoM>KG</UoM>
              <Scrap>0</Scrap>
              <Costing>X</Costing>
              <FunctionCode>Base 1 compound</FunctionCode>
              <ValidFrom/>
              <ValidUntil/>
              <MaxShelfLife>-1</MaxShelfLife>
              <MinAging>-1</MinAging>
            </BomItem>
            <BomItem>
              <LineNr>40</LineNr>
              <ItemCategory>L</ItemCategory>
              <ArticleCode>E1726</ArticleCode>
              <Amount>0.109</Amount>
              <UoM>KG</UoM>
              <Scrap>0</Scrap>
              <Costing>X</Costing>
              <FunctionCode>Wingtip compound</FunctionCode>
              <ValidFrom/>
              <ValidUntil/>
              <MaxShelfLife>-1</MaxShelfLife>
              <MinAging>-1</MinAging>
            </BomItem>
            <BomItem>
              <LineNr>50</LineNr>
              <ItemCategory>L</ItemCategory>
              <ArticleCode>E1722</ArticleCode>
              <Amount>0.347</Amount>
              <UoM>KG</UoM>
              <Scrap>0</Scrap>
              <Costing>X</Costing>
              <FunctionCode>Base 2 compound</FunctionCode>
              <ValidFrom/>
              <ValidUntil/>
              <MaxShelfLife>-1</MaxShelfLife>
              <MinAging>-1</MinAging>
            </BomItem>
          </BomItems>
        </BomVersion>
      </BomVersions>
    </UpdateOrCreateBom>
  </soap:Body>
</soap:Envelope>